emacs.org
# Created 2018-02-20 Tue 17:15
#+OPTIONS: -:nil --:nil tex:t ^:nil num:nil
#+TITLE: emacs
#+DATE: 2018-02-20
#+AUTHOR: Dongsoo Lee
#+MACRO: class @@html:<span class="lc-class">$1</span>@@
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="emacs - Linux命令">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="emacs - Linux命令">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="emacs - Linux命令">
#+HTML_HEAD: <meta name="twitter:description" content="">

* 如何安装

** 先决条件

*** Ubuntu

- [[file:./apt-add-repository.org][apt-add-repository]]

*** Mac OS

- [[file:./brew.org][brew]]

** 安装

*** Ubuntu

**** Emacs 25

#+NAME: ubuntu-install_emacs25
#+BEGIN_SRC sh
  $ sudo apt-add-repository -y ppa:adrozdoff/emacs
  $ sudo apt update
  $ sudo apt install emacs25
#+END_SRC

*** Mac OS

#+NAME: macos-install_emacs25
#+BEGIN_SRC sh
  $ brew install emacs
#+END_SRC

** 安装的软件包
- aspell
- aspell-en
- dictionaries-common
- emacs25-bin-common
- emacs25-common
- emacs25-el
- emacsen-common
- enchant
- ghostscript
- gsfonts
- gstreamer1.0-plugins-base
- gstreamer1.0-plugins-good
- gstreamer1.0-x
- hunspell-en-us
- imagemagick-common
- libaa1
- libasound2
- libasound2-data
- libaspell15
- libavc1394-0
- libcaca0
- libcdparanoia0
- libcupsfilters1
- libcupsimage2
- libdv4
- libenchant1c2a
- libfftw3-double3
- libflac8
- libfribidi0
- libgeoclue0
- libgif7
- libgl1-mesa-glx
- libgpm2
- libgs9
- libgs9-common
- libgstreamer-plugins-base1.0-0
- libgstreamer-plugins-good1.0-0
- libgstreamer1.0-0
- libharfbuzz-icu0
- libhunspell-1.3-0
- libice6
- libiec61883-0
- libijs-0.35
- libjack-jackd2-0
- libjavascriptcoregtk-3.0-0
- libjbig2dec0
- liblockfile-bin
- liblockfile1
- liblqr-1-0
- libm17n-0
- libmagickcore-6.q16-2
- libmagickwand-6.q16-2
- libogg0
- libopus0
- liborc-0.4-0
- libotf0
- libpaper-utils
- libpaper1
- libraw1394-11
- libsamplerate0
- libshout3
- libslang2
- libsm6
- libspeex1
- libtag1v5
- libtag1v5-vanilla
- libtext-iconv-perl
- libtheora0
- libv4l-0
- libv4lconvert0
- libvisual-0.4-0
- libvorbis0a
- libvorbisenc2
- libwavpack1
- libwebkitgtk-3.0-0
- libwebkitgtk-3.0-common
- libwebp5
- libxcb-glx0
- libxslt1.1
- libxt6
- libxv1
- libxxf86vm1
- m17n-db
- poppler-data

** 检查
#+BEGIN_SRC sh
  $ emacs --version
  25.3
#+END_SRC

* 参考
- [[http://wikemacs.org/wiki/Installing_Emacs_on_GNU/Linux][Installing_Emacs_on_GNU/Linux]]
