ko/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<!-- 2018-02-20 Tue 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>
<meta name="title" content="emacs - 리눅스 명령어">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="emacs - 리눅스 명령어">
<meta property="og:description" content="">
<meta name="twitter:title" content="emacs - 리눅스 명령어">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4fbea5">설치 방법</a>
<ul>
<li><a href="#org648475d">필요 사항</a>
<ul>
<li><a href="#orgdf56379">Ubuntu</a></li>
<li><a href="#orgf4a9726">Mac OS</a></li>
</ul>
</li>
<li><a href="#orgc83e504">설치</a>
<ul>
<li><a href="#orga78eb30">Ubuntu</a>
<ul>
<li><a href="#org7bd4bbe">Emacs 25</a></li>
</ul>
</li>
<li><a href="#orga06e740">Mac OS</a></li>
</ul>
</li>
<li><a href="#org9e8a7fb">설치된 패키지</a></li>
<li><a href="#orgf0717bb">확인</a></li>
</ul>
</li>
<li><a href="#org7e54e05">참고자료</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge4fbea5" class="outline-2">
<h2 id="orge4fbea5">설치 방법</h2>
<div class="outline-text-2" id="text-orge4fbea5">
</div><div id="outline-container-org648475d" class="outline-3">
<h3 id="org648475d">필요 사항</h3>
<div class="outline-text-3" id="text-org648475d">
</div><div id="outline-container-orgdf56379" class="outline-4">
<h4 id="orgdf56379">Ubuntu</h4>
<div class="outline-text-4" id="text-orgdf56379">
<ul class="org-ul">
<li><a href="./apt-add-repository.html">apt-add-repository</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf4a9726" class="outline-4">
<h4 id="orgf4a9726">Mac OS</h4>
<div class="outline-text-4" id="text-orgf4a9726">
<ul class="org-ul">
<li><a href="./brew.html">brew</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc83e504" class="outline-3">
<h3 id="orgc83e504">설치</h3>
<div class="outline-text-3" id="text-orgc83e504">
</div><div id="outline-container-orga78eb30" class="outline-4">
<h4 id="orga78eb30">Ubuntu</h4>
<div class="outline-text-4" id="text-orga78eb30">
</div><div id="outline-container-org7bd4bbe" class="outline-5">
<h5 id="org7bd4bbe">Emacs 25</h5>
<div class="outline-text-5" id="text-org7bd4bbe">
<div class="org-src-container">
<pre class="src src-sh" id="orgce018bb">$ sudo apt-add-repository -y ppa:adrozdoff/emacs
$ sudo apt update
$ sudo apt install emacs25
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga06e740" class="outline-4">
<h4 id="orga06e740">Mac OS</h4>
<div class="outline-text-4" id="text-orga06e740">
<div class="org-src-container">
<pre class="src src-sh" id="org484bd2b">$ brew install emacs
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9e8a7fb" class="outline-3">
<h3 id="org9e8a7fb">설치된 패키지</h3>
<div class="outline-text-3" id="text-org9e8a7fb">
<ul class="org-ul">
<li>aspell</li>
<li>aspell-en</li>
<li>dictionaries-common</li>
<li>emacs25-bin-common</li>
<li>emacs25-common</li>
<li>emacs25-el</li>
<li>emacsen-common</li>
<li>enchant</li>
<li>ghostscript</li>
<li>gsfonts</li>
<li>gstreamer1.0-plugins-base</li>
<li>gstreamer1.0-plugins-good</li>
<li>gstreamer1.0-x</li>
<li>hunspell-en-us</li>
<li>imagemagick-common</li>
<li>libaa1</li>
<li>libasound2</li>
<li>libasound2-data</li>
<li>libaspell15</li>
<li>libavc1394-0</li>
<li>libcaca0</li>
<li>libcdparanoia0</li>
<li>libcupsfilters1</li>
<li>libcupsimage2</li>
<li>libdv4</li>
<li>libenchant1c2a</li>
<li>libfftw3-double3</li>
<li>libflac8</li>
<li>libfribidi0</li>
<li>libgeoclue0</li>
<li>libgif7</li>
<li>libgl1-mesa-glx</li>
<li>libgpm2</li>
<li>libgs9</li>
<li>libgs9-common</li>
<li>libgstreamer-plugins-base1.0-0</li>
<li>libgstreamer-plugins-good1.0-0</li>
<li>libgstreamer1.0-0</li>
<li>libharfbuzz-icu0</li>
<li>libhunspell-1.3-0</li>
<li>libice6</li>
<li>libiec61883-0</li>
<li>libijs-0.35</li>
<li>libjack-jackd2-0</li>
<li>libjavascriptcoregtk-3.0-0</li>
<li>libjbig2dec0</li>
<li>liblockfile-bin</li>
<li>liblockfile1</li>
<li>liblqr-1-0</li>
<li>libm17n-0</li>
<li>libmagickcore-6.q16-2</li>
<li>libmagickwand-6.q16-2</li>
<li>libogg0</li>
<li>libopus0</li>
<li>liborc-0.4-0</li>
<li>libotf0</li>
<li>libpaper-utils</li>
<li>libpaper1</li>
<li>libraw1394-11</li>
<li>libsamplerate0</li>
<li>libshout3</li>
<li>libslang2</li>
<li>libsm6</li>
<li>libspeex1</li>
<li>libtag1v5</li>
<li>libtag1v5-vanilla</li>
<li>libtext-iconv-perl</li>
<li>libtheora0</li>
<li>libv4l-0</li>
<li>libv4lconvert0</li>
<li>libvisual-0.4-0</li>
<li>libvorbis0a</li>
<li>libvorbisenc2</li>
<li>libwavpack1</li>
<li>libwebkitgtk-3.0-0</li>
<li>libwebkitgtk-3.0-common</li>
<li>libwebp5</li>
<li>libxcb-glx0</li>
<li>libxslt1.1</li>
<li>libxt6</li>
<li>libxv1</li>
<li>libxxf86vm1</li>
<li>m17n-db</li>
<li>poppler-data</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0717bb" class="outline-3">
<h3 id="orgf0717bb">확인</h3>
<div class="outline-text-3" id="text-orgf0717bb">
<div class="org-src-container">
<pre class="src src-sh">$ emacs --version
25.3
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e54e05" class="outline-2">
<h2 id="org7e54e05">참고자료</h2>
<div class="outline-text-2" id="text-org7e54e05">
<ul class="org-ul">
<li><a href="http://wikemacs.org/wiki/Installing_Emacs_on_GNU/Linux">Installing_Emacs_on_GNU/Linux</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-20 Tue 17:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
